; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 525790 1 1 4 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	spectrograph3 - mode
	image0 - mode
	spectrograph1 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Star4 image0)
	(have_image Phenomenon5 image0)
	(have_image Phenomenon6 infrared2)
	(have_image Star7 spectrograph1)
	(have_image Phenomenon8 spectrograph3)
	(have_image Planet9 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
4. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 1 of 6
5. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
6. (take_image satellite0 star4 instrument0 image0)
   added: (have_image star4 image0)
   goals met: 2 of 6
7. (turn_to satellite0 planet9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet9)
   goals met: 2 of 6
8. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 3 of 6
9. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
10. (take_image satellite0 phenomenon8 instrument0 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 4 of 6
11. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 6
12. (take_image satellite0 phenomenon6 instrument0 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 5 of 6
13. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 5 of 6
14. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 6 of 6
